shellxml/GetInvoiceDetail.txt

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetInvoiceDetail xmlns="https://tts.turkiyeshell.com">
		<cust_code>{customercode}</cust_code>
		<user_id>{userid}</user_id>
		<password>{password}</password>
		<branch_code>{branchcode}</branch_code>
		<invoice_number>{invoiceno}</invoice_number>
		<invoice_start_date>{bgndate}T09:00:00</invoice_start_date>
		<invoice_end_date>{enddate}T09:00:00</invoice_end_date>
		<customer_reference>{reference}</customer_reference>
    </GetInvoiceDetail>
  </soap:Body>
</soap:Envelope>